Updated the Tenant state machine diagram
